clc,clear;
time=xlsread('问题1各层材料系数.xlsx','sheet2','B3:B5403');
T0=75; %外界温度
T1=37; %内部温度
lana=118; %空气与第一层的热对流系数
lanb=0.02644; %皮肤与空气层的热对流系数
rho=[300 862 74.2 1.18]; %各层密度
c=[1377 2100 1726 1005]; %比热容
K=[0.082, 0.37, 0.045, 0.028]; %导热系数
a=K./(c.*rho)*10^8;
L=[6 60 36 50]; %各层厚度
x0=0; xf=sum(L); %厚度
t0=0; tf=5400; %时间
mul=1; tau=1;
h=1/mul;
M=(xf-x0)/h; %x分为M等分
N=(tf-t0)/tau;
u=zeros(M+1,N+1);
r=a.*tau/h^2;
x=x0:h:xf;
t=t0:tau:tf;
u(1:L(1),1)=37; %初值
u(1+L(1):L(1)+L(2),1)=37;
u(L(1)+L(2)+1:L(1)+L(2)+L(3),1)=37;
u(L(1)+L(2)+L(3)+1:L(1)+L(2)+L(3)+L(4),1)=37;
for j=1:N+1 %边值
 u(1,j)=T0;
 u(M+1,j)=37;
end
%追赶法求解的第一列
aa(1:L(1)-2)=-r(1);
aa(L(1)-1)=-K(1);
aa(L(1):L(1)+L(2)-2)=-r(2);
aa(L(1)+L(2)-1)=-K(2);
aa(L(1)+L(2):L(1)+L(2)+L(3)-2)=-r(3);
aa(L(1)+L(2)+L(3)-1)=-K(3);
aa(L(1)+L(2)+L(3):L(1)+L(2)+L(3)+L(4)-2)=-r(4);
%第二列
cc(1:L(1)-1)=-r(1);
cc(L(1))=-K(2);
cc(L(1)+1:L(1)+L(2)-1)=-r(2);
cc(L(1)+L(2))=-K(3);
cc(L(1)+L(2)+1:L(1)+L(2)+L(3)-1)=-r(3);
cc(L(1)+L(2)+L(3))=-K(4);
cc(L(1)+L(2)+L(3)+1:L(1)+L(2)+L(3)+L(4)-2)=-r(4);
%第三列
bb(1:L(1)-1)=1+2*r(1);
bb(L(1))=K(1)+K(2);
bb(L(1)+1:L(1)+L(2)-1)=1+2*r(2);
bb(L(1)+L(2))=K(2)+K(3);
bb(L(1)+L(2)+1:L(1)+L(2)+L(3)-1)=1+2*r(3);
bb(L(1)+L(2)+L(3))=K(3)+K(4);
bb(L(1)+L(2)+L(3)+1:L(1)+L(2)+L(3)+L(4)-1)=1+2*r(4);
%加入边值条件后的线性矩阵
aa=[0,aa,-2*r(4)];
cc=[-2*r(1),cc,0];
bb=[1+2*r(1)-2*r(1)*h*lana/(-K(1)),bb,1+2*r(4)+2*r(4)*h*lanb/(-K(4))];
for j=2:N+1 %向前差分法求数值解
 
 dd=[u(2,j-1)+r(1)*u(1,j);u(3:M-1,j-1);
 u(M,j-1)+r(4)*u(M+1,j)];
 dd(L(1))=0;
 dd(L(1)+L(2))=0;
 dd(L(1)+L(2)+L(3))=0;
 
 dd=[u(1,j-1)-T0*2*r(1)*h*lana/(-K(1));dd;u(M+1,j-1)+2*r(4)*h*T1*lanb/(-K(4))];
 
 A=tridiag(aa,bb,cc,dd);
 u(1:M+1,j)=A;
 % u(1:M+1,j)=A;
end
[a,b]=meshgrid(t,x);
mesh(a,b,u);
shading interp;